//골뱅이 찍기 - ㅌ
//시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
//1 초	512 MB	1156	969	936	85.091%
//문제
//서준이는 아빠로부터 골뱅이가 들어 있는 상자를 생일 선물로 받았다. 상자 안에는 ㅌ자 모양의 골뱅이가 들어있다. ㅌ자 모양은 가로 및 세로로 각각 5개의 셀로 구성되어 있다. 상자에는 정사각형 모양의 셀의 크기를 나타내는 숫자 하나가 적혀있다. 셀의 크기 N이 주어지면 예제 출력과 같은 방식으로 골뱅이 모양을 출력하시오.
//
//입력
//첫째 줄에 정수 N(1 ≤ N ≤ 100)이 주어진다.
//
//출력
//셀의 크기가 N인 골뱅이를 출력한다.
//
//예제 입력 1 
//1
//예제 출력 1 
//@@@@@
//@
//@@@@@
//@
//@@@@@
//예제 입력 2 
//3
//예제 출력 2 
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
//@@@
//@@@
//@@@
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
//@@@
//@@@
//@@@
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
//@@@@@@@@@@@@@@@
	import java.util.Scanner;
	public class Main {
		public static void main(String[] args) {
			// 입력
			Scanner k = new Scanner(System.in);
			int N = 0;
			while (true) {
				N = k.nextInt();
				if (1 <= N && N <= 100) {
					break;
				}
			}
			
			for (int i = 0; i < N * 5; i++) {
				for (int j = 0; j < N * 5; j++) {
					if (i < N || N * 2 <= i && i < N * 3 || N * 4 <= i && i < N * 5) {
						System.out.print("@");
					}else if(N <= i && i < N * 2 && 0 <= j && j < N|| N * 3 <= i && i < N * 4 && 0 <= j && j < N){
						System.out.print("@");
					}
				}
				System.out.println();
			}
		}
	}
